bilskyi/bit-esp32/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# Most ESP32-C3 devkits expose the console over the built-in USB Serial/JTAG
# rather than a UART bridge. If your board has a CP2102/CH340 chip instead,
# switch this to CONFIG_ESP_CONSOLE_UART_DEFAULT.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 1 ms tick keeps the audio task's timing predictable once playback exists.
CONFIG_FREERTOS_HZ=1000

# printf() is called from the audio loop with a double in it.
CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y

# Separate the websocket client's send and receive locks.
#
# By default one lock covers both. Streaming microphone audio at 32 KB/s holds
# it almost continuously, so the client's own task cannot process an incoming
# PONG in time, decides the peer is gone, and aborts the connection. That is
# the esp_tls=97 disconnect: it only ever happened while uploading, never idle.
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
# A send occasionally stalls for over a second on WiFi while holding the
# client lock. At the default two seconds the keepalive PONG gives up waiting,
# and the client tears down a perfectly healthy connection - the log says so
# outright: "Could not lock ws-client within 2000 timeout for PONG".
CONFIG_ESP_WS_CLIENT_TX_LOCK_TIMEOUT_MS=15000
